Pair Programming Pandas VI

El objetivo de este ejercicio es agrupar los datos para contestar las siguientes preguntas:
1. 쮺u치ntos ataques hubo por pa칤s? Devuelve un DataFrame.
游늷 NOTA Ordena los resultados de mayor a menor. Esto todav칤a no lo hemos visto, pero un DataFrame lo podemos ordenar con .sort_values().  ten칠is una explicaci칩n de c칩mo hacerlo.

In [2]:
import pandas as pd
import numpy as np

In [3]:
df= pd.read_csv("attacks_modificado_3.csv", index_col=0)
df.head(3)

,unnamed:_0,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo,fatal_(y/n),injury,date
0,0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,6,2018.06.03.a,2018.0,Unprovoked,BRAZIL,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,M,18,Late afternoon,Tiger shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,Y,FATAL,03-Jun-2018
2,8,2018.05.26.b,2018.0,Unprovoked,USA,Florida,"Cocoa Beach, Brevard County",Walking,Cody High,M,15,17h00,"Bull shark, 6'",http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,N,Lower left leg bitten,26-May-2018

In [4]:
df.columns

Index(['unnamed:_0', 'case_number', 'year', 'type', 'country', 'area',
       'location', 'activity', 'name', 'sex_', 'age', 'time', 'species_',
       'href', 'siglo', 'fatal_(y/n)', 'injury', 'date'],
      dtype='object')

In [5]:
df_pais = df.groupby(['country'])['case_number'].count().sort_values(ascending= False)
df_pais

country
USA             741
AUSTRALIA       343
SOUTH AFRICA    234
BAHAMAS          29
NEW ZEALAND      21
               ...
PHILIPPINES       1
RED SEA?          1
EL SALVADOR       1
ROATAN            1
LIBYA             1
Name: case_number, Length: 95, dtype: int64

In [6]:
# otro metodo
df['country'].value_counts()

USA                   741
AUSTRALIA             343
SOUTH AFRICA          234
BAHAMAS                29
NEW ZEALAND            21
                     ...
GREENLAND               1
ST. MAARTIN             1
UNITED KINGDOM          1
SWEDEN                  1
CEYLON (SRI LANKA)      1
Name: country, Length: 95, dtype: int64

In [7]:
# creamos el DataFrame para visualizar el resultado
df_pais = pd.DataFrame(df_pais)
df_pais

              case_number
country
USA                   741
AUSTRALIA             343
SOUTH AFRICA          234
BAHAMAS                29
NEW ZEALAND            21
...                   ...
PHILIPPINES             1
RED SEA?                1
EL SALVADOR             1
ROATAN                  1
LIBYA                   1

[95 rows x 1 columns]

2. 쮺u치ntos ataques ha habido por a침o? Devuelve un DataFrame. De nuevo ordena los resultados de mayor a menor.

In [8]:
df_a침o = df.groupby('year')['case_number'].count().sort_values(ascending= False)
df_a침o

year
0.0       125
2015.0     68
2007.0     57
2012.0     54
2002.0     53
         ...
1784.0      1
1783.0      1
1787.0      1
1779.0      1
1780.0      1
Name: case_number, Length: 147, dtype: int64

In [9]:
df['year'].value_counts()

0.0       125
2015.0     68
2007.0     57
2012.0     54
2002.0     53
         ...
1785.0      1
1783.0      1
1780.0      1
1779.0      1
1784.0      1
Name: year, Length: 147, dtype: int64

In [10]:
df_a침o = pd.DataFrame(df_a침o)
df_a침o.head()

        case_number
year
0.0             125
2015.0           68
2007.0           57
2012.0           54
2002.0           53

3. 쮺u치ntos ataques hubo por a침o y sexo? Devolved un DataFrame solo del a침o 2000 en adelante.

In [11]:
df_a침o_sexo = df[df['year']>2000].groupby(['year', 'sex_'])['case_number'].count()
df_a침o_sexo

year    sex_
2001.0  F        3
        M       26
2002.0  F        6
        M       47
2003.0  F        6
        M       38
2004.0  F        4
        M       35
        lli      1
2005.0  F        7
        M       38
2006.0  F        8
        M       32
2007.0  F       19
        M       38
2008.0  F        5
        M       35
2009.0  F        5
        M       37
2010.0  F       12
        M       25
2011.0  F        5
        M       31
2012.0  F        9
        M       45
2013.0  F        5
        M       43
2014.0  F        7
        M       28
2015.0  F       12
        M       56
2016.0  F        7
        M       30
2017.0  F        9
        M       21
2018.0  F        2
        M       15
Name: case_number, dtype: int64

In [12]:
df_a침o_sexo = pd.DataFrame(df_a침o_sexo)
df_a침o_sexo.head()

             case_number
year   sex_
2001.0 F               3
       M              26
2002.0 F               6
       M              47
2003.0 F               6

In [13]:
# para verificar la respuesta
df[df['year']== 2001].count()

unnamed:_0     29
case_number    29
year           29
type           29
country        29
area           29
location       29
activity       29
name           29
sex_           29
age            29
time           29
species_       29
href           29
siglo           0
fatal_(y/n)    29
injury         29
date           29
dtype: int64

4. Primero extraed solo las filas que correspondan a USA, AUSTRALIA y SOUTH AFRICA. 쮺u치ntos de los ataques fueron letales por sexo? Devuelve un DataFrame.

In [18]:
# vamos a filtrar por los paises que nos piden

df['country'].isin(['USA','AUSTRALIA', 'SOUTH AFRICA'])  # este es el filtro

0        True
1       False
2        True
3        True
4       False
        ...
1667     True
1668     True
1669     True
1670    False
1671    False
Name: country, Length: 1672, dtype: bool

In [20]:
#pongo el filtro en mi dataframe para sacar los datos
df[df['country'].isin(['USA','AUSTRALIA', 'SOUTH AFRICA'])].head(2)

,unnamed:_0,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo,fatal_(y/n),injury,date
0,0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
2,8,2018.05.26.b,2018.0,Unprovoked,USA,Florida,"Cocoa Beach, Brevard County",Walking,Cody High,M,15,17h00,"Bull shark, 6'",http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,N,Lower left leg bitten,26-May-2018

In [28]:
#cuantos muertos hubo por sexo. Agrupamos por sexo y fatal, pedimos que nos muestre solo la columna fatal y las contamos

df_letales_sexo = df[df['country'].isin(['USA','AUSTRALIA', 'SOUTH AFRICA'])].groupby(['sex_', 'fatal_(y/n)'])['fatal_(y/n)'].count()
df_letales_sexo

sex_  fatal_(y/n)
F     N              142
      Y               20
M      N               2
      N              906
      UNKNOWN          1
      Y              172
lli   N                1
Name: fatal_(y/n), dtype: int64

```python

# esto era similar al ejemplo de los apuntes:
df_genero_tama침o = df.groupby(["gender", "vehicle_size"])['number_of_policies'].mean() # en vez de mean() usamos count()
df_genero_tama침o
```

In [ ]:
# nos pide un DataFrame

In [31]:
df_letales_sexo = pd.DataFrame(df_letales_sexo)
df_letales_sexo

                  fatal_(y/n)
sex_ fatal_(y/n)
F    N                    142
     Y                     20
M     N                     2
     N                    906
     UNKNOWN                1
     Y                    172
lli  N                      1

5. Usando el DataFrame creado en el ejercicio anterior. 쮼n qu칠 pa칤s hubo m치s ataques?

In [32]:
# recuperamos el df filtrado
df[df['country'].isin(['USA','AUSTRALIA', 'SOUTH AFRICA'])].head(2)

,unnamed:_0,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo,fatal_(y/n),injury,date
0,0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
2,8,2018.05.26.b,2018.0,Unprovoked,USA,Florida,"Cocoa Beach, Brevard County",Walking,Cody High,M,15,17h00,"Bull shark, 6'",http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,N,Lower left leg bitten,26-May-2018

In [33]:
# lo guardo en una variable para poder contar y sacar el maximo de cada pais, hay que agrupar por pais
df_paises =df[df['country'].isin(['USA','AUSTRALIA', 'SOUTH AFRICA'])]

In [34]:
df_paises.groupby('country')

In [35]:
# y ahora pido que cuente las filas, es m치s, le voy a pedir un max(), a ver que pasa. Para el conteo nos sirve cualquier columna sin nulos [country], [case_number], etc
df_paises.groupby('country')['country'].max()

country
AUSTRALIA          AUSTRALIA
SOUTH AFRICA    SOUTH AFRICA
USA                      USA
Name: country, dtype: object

In [36]:
# no sirve con el max solo, te pilla el max de un string... sigo probando
df_paises.groupby('country')['country'].count().max() # no saca el pais y el maximo a la vez

741

In [38]:
# aqui ya si hemos podido sacar el conteo, y lo ordenamos en descendente para ver el maximo primero
df_paises.groupby('country')['country'].count().sort_values(ascending= False)

country
USA             741
AUSTRALIA       343
SOUTH AFRICA    234
Name: country, dtype: int64

In [45]:
# PRUEBAS a ver si puedo sacar pais y valor maximo, que se muestre a la vez 
df_paises_prueba = df_paises.groupby('country').count()   #[df_paises['case_number'].count() == 741], le quiero a침adir este filtro para obtener el maximo

In [48]:
df_paises_prueba

,unnamed:_0,case_number,year,type,area,location,activity,name,sex_,age,time,species_,href,siglo,fatal_(y/n),injury,date
country,,,,,,,,,,,,,,,,,
AUSTRALIA,343,343,343,343,338,335,338,343,342,325,324,330,343,19,326,342,343
SOUTH AFRICA,234,234,234,234,234,234,234,234,234,226,226,226,234,8,224,234,234
USA,741,741,741,741,740,739,739,741,741,722,720,726,741,22,695,741,741

In [49]:
df_paises_prueba[df_paises_prueba['case_number'] == 741]  # le tuve que quitar el count al filtro, porque claro, era mas sencillo, solo habia que [llamar] a la columna, que ya tenia el conteo

,unnamed:_0,case_number,year,type,area,location,activity,name,sex_,age,time,species_,href,siglo,fatal_(y/n),injury,date
country,,,,,,,,,,,,,,,,,
USA,741,741,741,741,740,739,739,741,741,722,720,726,741,22,695,741,741

In [50]:
# ahora le pido que solo me muestre case_number
df_paises_prueba[df_paises_prueba['case_number'] == 741]['case_number']

country
USA    741
Name: case_number, dtype: int64

In [56]:
# lo pasamos a df
df_pais_max_casos = pd.DataFrame(df_paises_prueba[df_paises_prueba['case_number'] == 741]['case_number'])
df_pais_max_casos

         case_number
country
USA              741

In [57]:
# UNA FORMA ALTERNATIVA 쯫 si no se cual es el maximo de ataques?
df_paises.groupby('country')['country'].count()

country
AUSTRALIA       343
SOUTH AFRICA    234
USA             741
Name: country, dtype: int64

In [58]:
# como es una serie, llamo a sus values y ahi hago max
df_paises.groupby('country')['country'].count().values

array([343, 234, 741])

In [59]:
df_paises.groupby('country')['country'].count().values.max()

741

In [60]:
# ahora lo guardo enuna variable y podria servir de filtro
max_ataques = df_paises.groupby('country')['country'].count().values.max()
max_ataques

741

6. 쯈u칠 y cu치ntos tipos de ataques hubo por pa칤s?

In [51]:
# qu칠 tipos de ataque y cuantos == group by + .count() == value.counts()
df.type.value_counts()

Unprovoked      1432
Provoked         115
Invalid           92
Boating           17
Sea Disaster      12
Boat               4
Name: type, dtype: int64

In [52]:
# con group by
df.groupby('type').count()

,unnamed:_0,case_number,year,country,area,location,activity,name,sex_,age,time,species_,href,siglo,fatal_(y/n),injury,date
type,,,,,,,,,,,,,,,,,
Boat,4,4,4,4,3,2,3,4,1,0,0,3,4,4,4,4,4
Boating,17,17,17,17,17,17,17,17,17,17,17,17,17,0,17,17,17
Invalid,92,92,92,92,91,91,91,91,91,87,87,92,92,5,6,92,92
Provoked,115,115,115,114,111,112,113,115,115,109,107,110,115,8,115,115,115
Sea Disaster,12,12,12,11,9,9,10,11,11,5,7,6,12,7,12,12,12
Unprovoked,1432,1432,1432,1424,1395,1390,1407,1425,1423,1300,1294,1318,1432,146,1431,1424,1432

In [54]:
#ha contado los no nulos por cada columna, como es un dataframe, ahora le pido con [] que solo nos mueste una de las columnas, por ejemplo case number, que no tiene nulos 
df.groupby('type').count()['case_number']

type
Boat               4
Boating           17
Invalid           92
Provoked         115
Sea Disaster      12
Unprovoked      1432
Name: case_number, dtype: int64